web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_DE_HAL_Sig_Opt_A_v12.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/ship/v12">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <v12:ProcessShipmentRequest>
         <v12:WebAuthenticationDetail>
            <v12:UserCredential>
               <v12:Key></v12:Key>
               <v12:Password/>
            </v12:UserCredential>
         </v12:WebAuthenticationDetail>
         <v12:ClientDetail>
            <v12:AccountNumber></v12:AccountNumber>
            <v12:MeterNumber></v12:MeterNumber>
            <v12:IntegratorId>12345</v12:IntegratorId>
            <v12:Localization>
               <v12:LanguageCode>EN</v12:LanguageCode>
               <v12:LocaleCode>ES</v12:LocaleCode>
            </v12:Localization>
         </v12:ClientDetail>
         <v12:TransactionDetail>
            <v12:CustomerTransactionId>Hold shipment at the specified location</v12:CustomerTransactionId>
            <v12:Localization>
               <v12:LanguageCode>EN</v12:LanguageCode>
               <v12:LocaleCode>ES</v12:LocaleCode>
            </v12:Localization>
         </v12:TransactionDetail>
         <v12:Version>
            <v12:ServiceId>ship</v12:ServiceId>
            <v12:Major>12</v12:Major>
            <v12:Intermediate>1</v12:Intermediate>
            <v12:Minor>0</v12:Minor>
         </v12:Version>
         <v12:RequestedShipment>
            <v12:ShipTimestamp>2012-08-16T10:57:25-06:00</v12:ShipTimestamp>
            <v12:DropoffType>REGULAR_PICKUP</v12:DropoffType>
            <v12:ServiceType>PRIORITY_OVERNIGHT</v12:ServiceType>
            <v12:PackagingType>YOUR_PACKAGING</v12:PackagingType>
            <v12:Shipper>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Tins>
                  <v12:TinType>PERSONAL_STATE</v12:TinType>
                  <v12:Number>1057</v12:Number>
                  <v12:Usage>ShipperTinsUsage</v12:Usage>
               </v12:Tins>
               <v12:Contact>
                  <v12:ContactId>RBB1057</v12:ContactId>
                  <v12:PersonName>ROHIT BORSE</v12:PersonName>
                  <v12:Title>Mr.</v12:Title>
                  <v12:CompanyName>DEOYAROHIT0705$</v12:CompanyName>
                  <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                  <v12:PhoneExtension>02033469</v12:PhoneExtension>
                  <v12:PagerNumber>9762308621</v12:PagerNumber>
                  <v12:FaxNumber>9762308621</v12:FaxNumber>
                  <v12:EMailAddress>Rohit*Borse@DeoyaRohit.com</v12:EMailAddress>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>SHIPPER ADDRESS LINE 1</v12:StreetLines>
                  <v12:StreetLines>SHIPPER ADDRESS LINE 2</v12:StreetLines>
                  <v12:City>COLORADO SPRINGS</v12:City>
                  <v12:StateOrProvinceCode>CO</v12:StateOrProvinceCode>
                  <v12:PostalCode>80915</v12:PostalCode>
                  <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                  <v12:CountryCode>US</v12:CountryCode>
                  <v12:Residential>0</v12:Residential>
               </v12:Address>
            </v12:Shipper>
            <v12:Recipient>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Tins>
                  <v12:TinType>PERSONAL_STATE</v12:TinType>
                  <v12:Number>0705</v12:Number>
                  <v12:Usage>RecipientTinsUsage</v12:Usage>
               </v12:Tins>
               <v12:Contact>
                  <v12:ContactId>DRB0705</v12:ContactId>
                  <v12:PersonName>DEOYANEE BHADANE</v12:PersonName>
                  <v12:Title>Ms.</v12:Title>
                  <v12:CompanyName>DEOYAROHIT0705$</v12:CompanyName>
                  <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                  <v12:PhoneExtension>02033469</v12:PhoneExtension>
                  <v12:PagerNumber>9762308621</v12:PagerNumber>
                  <v12:FaxNumber>9762308621</v12:FaxNumber>
                  <v12:EMailAddress>Deoyanee*Bhadane@DeoyaRohit.com</v12:EMailAddress>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>RECIPIENT ADDRESS LINE 1</v12:StreetLines>
                  <v12:StreetLines>RECIPIENT ADDRESS LINE 2</v12:StreetLines>
                  <v12:City>DENVER</v12:City>
                  <v12:StateOrProvinceCode>CO</v12:StateOrProvinceCode>
                  <v12:PostalCode>80204</v12:PostalCode>
                  <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                  <v12:CountryCode>US</v12:CountryCode>
                  <v12:Residential>0</v12:Residential>
               </v12:Address>
            </v12:Recipient>
            <v12:RecipientLocationNumber>DEN001</v12:RecipientLocationNumber>
            <v12:Origin>
               <v12:Contact>
                  <v12:ContactId>RBB1057</v12:ContactId>
                  <v12:PersonName>ROHIT BORSE</v12:PersonName>
                  <v12:Title>Mr.</v12:Title>
                  <v12:CompanyName>DEOYAROHIT0705$</v12:CompanyName>
                  <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                  <v12:PhoneExtension>02033469</v12:PhoneExtension>
                  <v12:PagerNumber>9762308621</v12:PagerNumber>
                  <v12:FaxNumber>9762308621</v12:FaxNumber>
                  <v12:EMailAddress>Rohit*Borse@DeoyaRohit.com</v12:EMailAddress>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>ORIGIN ADDRESS LINE 1</v12:StreetLines>
                  <v12:StreetLines>ORIGIN ADDRESS LINE 2</v12:StreetLines>
                  <v12:City>COLORADO SPRINGS</v12:City>
                  <v12:StateOrProvinceCode>CO</v12:StateOrProvinceCode>
                  <v12:PostalCode>80915</v12:PostalCode>
                  <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                  <v12:CountryCode>US</v12:CountryCode>
                  <v12:Residential>0</v12:Residential>
               </v12:Address>
            </v12:Origin>
            <v12:ShippingChargesPayment>
               <v12:PaymentType>SENDER</v12:PaymentType>
               <v12:Payor>
                  <v12:ResponsibleParty>
                     <v12:AccountNumber></v12:AccountNumber>
                     <v12:Contact>
                        <v12:ContactId>RBB1057</v12:ContactId>
                        <v12:PersonName>ROHIT BORSE</v12:PersonName>
                        <v12:Title>Mr.</v12:Title>
                        <v12:CompanyName>DEOYAROHIT0705$</v12:CompanyName>
                        <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                        <v12:PhoneExtension>02033469</v12:PhoneExtension>
                        <v12:PagerNumber>9762308621</v12:PagerNumber>
                        <v12:FaxNumber>9762308621</v12:FaxNumber>
                        <v12:EMailAddress>Rohit*Borse@DeoyaRohit.com</v12:EMailAddress>
                     </v12:Contact>
                     <v12:Address>
                        <v12:StreetLines>SHIPPER ADDRESS LINE 1</v12:StreetLines>
                        <v12:StreetLines>SHIPPER ADDRESS LINE 2</v12:StreetLines>
                        <v12:City>HARRISON</v12:City>
                        <v12:StateOrProvinceCode>AR</v12:StateOrProvinceCode>
                        <v12:PostalCode>72601</v12:PostalCode>
                        <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                        <v12:CountryCode>US</v12:CountryCode>
                        <v12:Residential>0</v12:Residential>
                     </v12:Address>
                  </v12:ResponsibleParty>
               </v12:Payor>
            </v12:ShippingChargesPayment>

            <v12:SpecialServicesRequested>
               <v12:SpecialServiceTypes>HOLD_AT_LOCATION</v12:SpecialServiceTypes>
               <v12:HoldAtLocationDetail>
                  <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                  <v12:LocationContactAndAddress>
                     <v12:Contact>
                        <v12:ContactId>DRB0705</v12:ContactId>
                        <v12:PersonName>DEOYANEE BHADANE</v12:PersonName>
                        <v12:Title>Ms.</v12:Title>
                        <v12:CompanyName>DEOYAROHIT0705</v12:CompanyName>
                        <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                        <v12:PhoneExtension>02033469</v12:PhoneExtension>
                        <v12:PagerNumber>9762308621</v12:PagerNumber>
                        <v12:FaxNumber>9762308621</v12:FaxNumber>
                        <v12:EMailAddress>Rohit*Borse@syntelinc.com</v12:EMailAddress>
                     </v12:Contact>
                     <v12:Address>
                        <v12:StreetLines>HAL ADDRESS LINE 1</v12:StreetLines>
                        <v12:StreetLines>HAL ADDRESS LINE 2</v12:StreetLines>
                        <v12:City>DENVER</v12:City>
                        <v12:StateOrProvinceCode>CO</v12:StateOrProvinceCode>
                        <v12:PostalCode>80202</v12:PostalCode>
                        <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                        <v12:CountryCode>US</v12:CountryCode>
                        <v12:Residential>0</v12:Residential>
                     </v12:Address>
                  </v12:LocationContactAndAddress>
                  <v12:LocationType>FEDEX_EXPRESS_STATION</v12:LocationType>
               </v12:HoldAtLocationDetail>
            </v12:SpecialServicesRequested>
            <v12:DeliveryInstructions>DeliveryInstructions</v12:DeliveryInstructions>
            <v12:PickupDetail>
               <v12:ReadyDateTime>2011-06-15T10:57:25-06:00</v12:ReadyDateTime>
               <v12:LatestPickupDateTime>2011-06-15T10:57:25-06:00</v12:LatestPickupDateTime>
               <v12:CourierInstructions>PickupCourierInstructions</v12:CourierInstructions>
               <v12:RequestType>SAME_DAY</v12:RequestType>
               <v12:RequestSource>CUSTOMER_SERVICE</v12:RequestSource>
            </v12:PickupDetail>
            <v12:BlockInsightVisibility>1</v12:BlockInsightVisibility>
            <v12:ErrorLabelBehavior>STANDARD</v12:ErrorLabelBehavior>
            <v12:LabelSpecification>
               <v12:LabelFormatType>COMMON2D</v12:LabelFormatType>
               <v12:ImageType>PNG</v12:ImageType>
               <v12:LabelStockType>PAPER_4X6</v12:LabelStockType>
               <v12:LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</v12:LabelPrintingOrientation>
            </v12:LabelSpecification>
            <v12:RateRequestTypes>ACCOUNT</v12:RateRequestTypes>
            <v12:PackageCount>1</v12:PackageCount>
            <v12:RequestedPackageLineItems>
               <v12:SequenceNumber>1</v12:SequenceNumber>
               <v12:GroupNumber>1</v12:GroupNumber>
               <v12:GroupPackageCount>1</v12:GroupPackageCount>
               <v12:Weight>
                  <v12:Units>LB</v12:Units>
                  <v12:Value>60</v12:Value>
               </v12:Weight>
               <v12:Dimensions>
                  <v12:Length>12</v12:Length>
                  <v12:Width>12</v12:Width>
                  <v12:Height>12</v12:Height>
                  <v12:Units>IN</v12:Units>
               </v12:Dimensions>
               <v12:PhysicalPackaging>BAG</v12:PhysicalPackaging>
               <v12:ItemDescription>ItemDescription</v12:ItemDescription>
               <v12:CustomerReferences>
                  <v12:CustomerReferenceType>CUSTOMER_REFERENCE</v12:CustomerReferenceType>
                  <v12:Value>CUSTREF10570705</v12:Value>
               </v12:CustomerReferences>
               <v12:CustomerReferences>
                  <v12:CustomerReferenceType>P_O_NUMBER</v12:CustomerReferenceType>
                  <v12:Value>PO10570705</v12:Value>
               </v12:CustomerReferences>
               <v12:CustomerReferences>
                  <v12:CustomerReferenceType>INVOICE_NUMBER</v12:CustomerReferenceType>
                  <v12:Value>IO10570705</v12:Value>
               </v12:CustomerReferences>
 <v12:SpecialServicesRequested>
                  <v12:SpecialServiceTypes>SIGNATURE_OPTION</v12:SpecialServiceTypes>
                  <v12:SignatureOptionDetail>
                     <v12:OptionType>ADULT</v12:OptionType>
                     <v12:SignatureReleaseNumber>SRN1234567</v12:SignatureReleaseNumber>
                  </v12:SignatureOptionDetail>
               </v12:SpecialServicesRequested>
               <v12:ContentRecords>
                  <v12:PartNumber>PRTNUM01</v12:PartNumber>
                  <v12:ItemNumber>ITMNUM01</v12:ItemNumber>
                  <v12:ReceivedQuantity>15</v12:ReceivedQuantity>
                  <v12:Description>ContentDescription</v12:Description>
               </v12:ContentRecords>
            </v12:RequestedPackageLineItems>
         </v12:RequestedShipment>
      </v12:ProcessShipmentRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>